{
	"Which command enables you to redirect stdout and stderr to a file?": "> filename 2>&1",
	"What file is processed for all users starting a login shell?": "/etc/profile",
	"What user-specific file is processed for a user starting a login shell?": "~/.bash_profile",
	"A user executes the command chmod +x myscript then the command myscript. It fails. Which environment variable will the current directory need to be added to?": "PATH",
	"Which command removes the in-memory state from the file of current history?": "history -c",
	"Which command ensures all history is removed?": "history -w",
	"Which command would replace all instances of 'old' with 'new' in vi?": "%s/old/new/g",
	"Which file contains messages displayed after user login?": "/etc/motd",
	"Which file contains messages displayed before user login?": "/etc/issue",
	"Which command locates commands related to a keyword?": "apropos",
	"What command updates the database searched by man -k or apropos?": "mandb",
	"Where are program files not required to boot a system typically stored?": "/usr",
	"Which directory contains files which may grow unexpectedly?": "/var",
	"Which directory contains config files needed to boot a server?": "/etc",
	"Which command shows human-readable mounted devices and filesystem types?": "df -hT",
	"Which command shows hidden files?": "ls -a",
	"Which command gives a long listing of files?": "ls -l",
	"Which command sorts files on mod time?": "ls -t",
	"Which command reverses the sorting of files?": "ls -r",
	"Which command enables you to copy hidden and regular files from /home/bob to the current directory?": "cp -a /home/bob/..",
	"Which command renames myfile to newfile?": "mv myfile newfile",
	"Which commands creates a symlink/soft link to /home in /tmp?": "ln -s /home /tmp",
	"Which switch adds one file to a .tar archive?": "-r",
	"Which command shows the first ten lines of file.txt?": "head file.txt",
	"Which command counts the lines words and characters in a file?": "wc",
	"Which key brings you to the end of a file in less or vi?": "G",
	"To specify the delimiter '' which command and switch would you use?": "cut -d ",
	"Which command can sort files or command output?": "sort",
	"In regex which character indicates the beginning of a line?": "^",
	"In regex which character refers to zero or one of the previous character essentially making the previous character optional?": "?",
	"In regex which character refers to any single character?": ".",
	"How would you grab the all users in a system via awk?": "awk -F  '{ print $3 }' /etc/passwd",
	"How would you find all users whose password was stored locally on the system using grep?": "grep -v \\* /etc/shadow",
	"The screen you are working from is called a _______.": "console",
	"The _______ is started as a working env.": "terminal",
	"The _________ interprets your commands.": "shell",
	"What is the first virtual console available on Linux known as?": "/dev/tty1",
	"What is the first pseudo terminal (terminal created in a GUI or via SSH) available in Linux known as?": "/dev/pts1",
	"A server reboot is usually only necessary after making changes to the _______.": "kernel",
	"What program would you use (other than WSL) to SSH from a Windows box?": "PuTTY",
	"Where are key fingerprints of hosts you've previously connected to stored?": "~/.ssh/known_hosts",
	"What option would you set in /etc/ssh/ssh_config to enable support for graphical applications via ssh?": "ForwardX11",
	"Which command would you use to copy a public key to a remote server?": "ssh-copy-id",
	"By default _______ is the only privileged user.": "root",
	"By default all members of the group _______ can sudo.": "wheel",
	"Which command would you use to cat the hashed user passwords stored locally?": "sudo cat /etc/shadow",
	"How would you show account aging info?": "chage -l",
	"If you absolutely had to edit /etc/group manually which command would you use?": "vigr",
	"Which command shows the uid of the current user their groups and the gid of those groups?": "id",
	"When the _______ file exists only root can log in. Any other user will see the contents of that file.": "/etc/nologin.txt",
	"Which command sets the effective primary group?": "newgrp",
	"Which command sets the group owner of a file?": "chgrp",
	"Which command searches all files that are owned by user jeff?": "find / -user jeff",
	"Using chown how would you set group executive as owner of file1?": "chown executive file1",
	"Using chgrp how would you set group linux as owner of file2?": "chgrp linux file2",
	"Which command would you issue to grant rw permissions to the user and group owners and no permissions to others for file newfile?": "chmod 660 newfile",
	"How would you set SGID on a directory /mydir?": "chmod g+s /mydir",
	"Which command would you issue to set an ACL that allows members of finance to access the /finance directory and read and write files therein?": "setfacl -m dgfinancerwx /finance",
	"Which command allows only user and group owners to access new files created in /scripts?": "setfacl -m do- /scripts",
	"Which umask value assigns all permissions to file owners read permissions to group owners and no permissions to others?": "027",
	"Which command checks attributes set on thisfile?": "lsattr thisfile",
	"An onboard NIC name on RHEL 8 would begin with ___.": "eno",
	"How would you get your current IP address as well as info about the interface?": "ip addr",
	"The text-based UI for NetworkManager can be reached with the ________ command.": "nmtui",
	"If you want examples of the nmcli command view the ______ man page.": "nmcli-examples",
	"Which file contains DNS server names but is automatically overwritten by NetworkManager?": "/etc/resolv.conf",
	"What command would you issue to change the contents of /etc/hostname?": "hostnamectl",
	"The _______ line indicates whether to check the integrity of packages using a GPG key.": "gpgcheck=",
	"For the RHCSA exam you need to connect to a _____ before you can install anything.": "repository",
	"Use the _____ parameter to point to the repo /repo on the local filesystem.": "baseurl=file///repo",
	"If a repository is ______ GPG package checking isn't very important.": "local",
	"What command would you use to search the package that contains the file pkgfile?": "yum whatprovides */pkgfile",
	"The _____ _____ yum module component enables you to work with different versions side by side.": "application stream",
	"Which command would you issue to install the devel profile of the PHP 7.1 application stream?": "yum module install php7.1/devel",
	"To install the package coolpkg.rpm which command would you use?": "yum install coolpkg.rpm",
	"How would you find the RPM package the file /file/path belongs to?": "rpm -qf /file/path",
	"How would you check if there are scripts in crazypackage.rpm?": "rpm -qp --scripts crazypackage.rpm",
	"A shell job is a type of process. So is a ____.": "daemon",
	"You just pressed Ctrl-z to freeze a job. What command would resume it in the background?": "bg",
	"Which command cancels a current job?": "Ctrl-C",
	"Which command sends EOF to a current job?": "Ctrl-D",
	"Which command freezes a current job?": "Ctrl-Z",
	"_____ processes can be more efficient than single-threaded processes. However threads cannot be individually managed by an admin.": "multi-threaded",
	"What command would you use for detailed info on a command and how it was started?": "ps ef",
	"Setting a process from nice value 0 to -19 ______ its priority.": "increases",
	"How would you set PID 4321 to niceness 5?": "renice 5 -p 4321",
	"Which command can send a signal to a process name?": "killall",
	"In top which command changes the priority of a process?": "r",
	"Which command sets the current performance profile to maxperf?": "tuned-adm profile maxperf",
	"Which command shows all service unit files on your system that are currently loaded?": "systemctl --type=service",
	"How do you create a want in systemd?": "systemctl enable",
	"How would you avoid conflicts between incompatible units?": "systemctl mask",
	"A systemd service may appear as Running(active) Running(exited) or Running(_______).": "waiting",
	"Socket units monitor socket activity which may include a file or _____ being accessed.": "port",
	"Valid systemd unit types include service socket and ______.": "mount",
	"Which command shows systemd units that have dependencies to a unit?": "systemctl list-dependencies --reverse",
	"How do you change systemd's default editor to nano?": "export SYSTEMD_EDITOR=/bin/nano",
	"Which keyword defines a systemd dependency which is not a pre-requisite to booting?": "D",
	"How would you disable the unit bad?": "systemctl disable bad",
	"Systemctl is used with the _____ option to check the current state of a service along with recent log messages.": "status",
	"The fields in cron timing are minute ____ day of month month and day of week.": "hour",
	"Which crontab setting launches a job every 5 mins M-F?": "*/5 * * * 1-5",
	"How would you edit the crontab for the current user?": "crontab -e",
	"What directory stores cron files for individual services that need tasks to be executed through cron?": "/etc/cron.d",
	"Which service executes jobs regularly but not at a specific time?": "anacron",
	"If the _____ file exists then a user must be listed in it for them to program cron jobs.": "cron.allow",
	"Which command queries the at service for jobs scheduled for execution?": "atq",
	"Rsyslogd and ______ work together to provide logging info.": "journald",
	"Which file are most messages written to?": "/var/log/messages",
	"Which file are auth messages written to?": "/var/log/secure",
	"Which file are SELinux events written to?": "/var/log/audit/audit.log",
	"In which file is the startup behaviour of rsyslogd specified?": "/etc/sysconfig/rsyslog",
	"When log info is sent to an rsyslogd module called mymodule how would it be referred to as?": "mymodule",
	"If you want to configure Apache to log messages through rsyslog use ______.": "local0-7",
	"Where should you insert a file to configure the logrotate service?": "/etc/logrotate.d",
	"Where is the systemd-journald journal stored?": "/run/log/journal",
	"Which file do you create to make journald journal persistent?": "/var/log/journal",
	"In _____ primary extended and logical partitions are treated similarly.": "GPT",
	"How many MiB to a GiB?": "1024",
	"Which partition type is used to create a Linux partition?": "83",
	"The virtio driver used by KVM generates the device ______ as the first disk device.": "/dev/vda",
	"What's the default FS used by RHEL 8?": "XFS",
	"Which command shows all filesystems their UUID and their label?": "blkid",
	"What would you put in the /etc/fstab device column to mount a filesystem based on the UUID 1a2bc3?": "UUID=1a2bc3",
	"Which number would you put in the sixth column in /etc/fstab to check a filesystem on boot after the root fs has been checked successfully?": "2",
	"Which mount option specifies that the filesystem depends on the network to be present before it can be mounted?": "_netdev",
	"A filesystem must be created on top of a logical volume T/F?": "F",
	"LVM offers features such as volume resizing hot replacement and ______.": "snapshots",
	"What must LVM partiitons be flagged with on a GPT disk?": "8e00",
	"Which command creates a logical volume lvdata that uses 50% of the free space from vgdata?": "lvcreate -n lvdata -l 50%FREE vgdata",
	"Which command is used to show extensive info about physical volumes?": "pvdisplay",
	"You cannot decrease the size of an XFS filesystem T/F?": "T",
	"How much storage does a Stratis volume require to write metadata?": "527 MiB",
	"You can only mount Stratis volumes using the UUID T/F?": "T",
	"VDO does well where redundant data is written because of its ____ features.": "deduplication",
	"Which option is used with mkfs.xfs to ensure that empty data blocks are not discarded immediately?": "-K",
	"What kind of kernel occurs when you use closed source drivers?": "tainted",
	"Which command shows the contents of the kernel ring buffer?": "dmesg",
	"Which command shows the current kernel version?": "uname -r",
	"Which command shows info about the hardware in your computer?": "uname -v",
	"Which file shows which version of RHEL you're using?": "/etc/redhat-release",
	"What process initializes new hardware devices?": "systemd-udevd",
	"While default rules for hardware initialization are stored in /usr/lib/udev/rules.d custom rules should be stored in _____.": "/etc/udev/rules.d",
	"Which command unloads a kernel module from memory?": "modprobe -r",
	"Which command shows devices on the PCI bus and supporting kernel modules which have been loaded?": "lspci -k",
	"What directory is used for files that create custom configuration?": "/etc/modprobe.d",
	"Which command installs a kernel?": "yum install kernel",
	"Which command creates a want for the current unit in the target that is listed in the [install] section in the service unit file?": "systemctl enable",
	"Which target do servers typically use?": "multi-user.target",
	"Which section in a unit file is used to specify in which target a unit should be started?": "[Install]",
	"How would you switch from a target from more to fewer unit files?": "systemctl isolate",
	"In a System V environment which environment corresponds to multi-user.target?": "3",
	"Which file should be edited directly to make changes to GRUB 2?": "/etc/default/grub",
	"Which command should be issued after editing /etc/default/grub?": "grub2-mkconfig > /boot/grub2/grub.cfg",
	"Where is the GRUB2 bootloader stored on an EFI system?": "/boot/efi/EFI/redhat/grub.cfg",
	"While booting the bootloader is loaded first then the kernel with the associated _____ then systemd.": "initramfs",
	"Which key sequence exits the GRUB 2 shell and continues booting?": "Ctrl-X",
	"Which file is used for managing initramfs?": "/etc/dracut/conf",
	"Which option can be used to drop to a shell at the end of the initrd phase?": "rd.break",
	"What boot option makes it impossible to see what's happening while booting?": "quiet",
	"Which systemd target basically only gives a root shell?": "emergency.target",
	"Which command remounts / in rw mode?": "mount -o remountrw /",
	"rd.break is applied after SELinux T/F?": "F",
	"What is the first line of a Bash shell script called?": "shebang",
	"When a script exits successfully what code does it use?": "0",
	"Which statement stops a script so the user can provide input?": "read",
	"The first argument to a script is referred to as ____.": "$1",
	"How would you refer to all arguments provided while starting a script separately?": "$@",
	"What closes an if statement?": "fi",
	"What follows the condition in a for loop?": "do",
	"What character indicates to the mail command to start sending a message?": ".",
	"In a case statement ____ refers to all options not specified.": "*)",
	"X11 forwarding applies to sessions that have already been authorized T/F?": "T",
	"Which parameter can be used to restrict SSH access to specific users?": "AllowUsers",
	"How do you allow a port in SELinux?": "semanage port",
	"Which setting logs failed login attempts?": "MaxAuthTries",
	"Where are login related settings logged?": "/var/log/secure",
	"Where are SSH client settings for a specific user stored?": "~/.ssh/ssh_config",
	"How would you install Apache?": "yum install httpd",
	"Where is the Apache web server configuration file?": "/etc/httpd/conf/httpd.conf",
	"What parameter specifies where Apache looks for its contents?": "DocumentRoot",
	"Which parameter specifies where Apache looks for its config files?": "ServerRoot",
	"Where is httpd.conf located?": "/etc/http/conf",
	"Where are Apache module config files located?": "/etc/httpd/modules.d",
	"Which directory is used by RPMs that can drop files in that directory without changing the contents of the main Apache configuration file?": "/etc/httpd/conf.d",
	"What is the default virtual host type?": "name-based",
	"SELinux can be set to enforcing ______ or disabled.": "permissive",
	"Other than getenforce which command enables you to see the current SELinux mode?": "sestatus",
	"SELinux security can be applied to users files and ____.": "ports",
	"Which switch which can be used with many commands displays SELinux related info?": "-Z",
	"Which SELinux command should be used to set context type if possible?": "semanage",
	"Which command should be run after moving a file mydoc to a new location /new?": "restorecon /new/mydoc",
	"Which command enables you to change a Boolean in a way that it survives a reboot?": "setsebool -P",
	"Which file contains everything you need to troubleshoot SELinux messages?": "/var/log/audit/audit.log",
	"SELinux log messages always contain what?": "avc",
	"What is the firewall implementation in the Linux kernel called?": "netfilter",
	"Which command shows all services available in firewalld?": "firewall-cmd --get-services",
	"What is the GUI tool used to manage firewall configurations?": "firewall-config",
	"What command do you need to issue after adding configuration with the --permanent option?": "firewall-cmd --reload",
	"What firewall-cmd command shows all configuration for all zones?": "--list-all",
	"Which mount option enables anonymous user access for an NFS share?": "sec=none",
	"Which package contains all that is needed to mount NFS shares?": "nfs-utils",
	"Which service do you need to add to the firewall in addition to rpc-bind to enable showmount to work?": "mountd",
	"How would you authenticate to a Samba share as sambauser?": "-o username=sambauser",
	"What would be the configuration file for /myfiles?": "/etc/auto.myfiles",
	"Which service does automount use?": "autofs",
	"When booting a server reads the _____ clock.": "hardware",
	"Hardware time is typically set to _____.": "UTC",
	"Which command can be used to manage time in RHEL?": "timedatectl",
	"Which character would you insert before the epoch time string to convert it to human time?": "@",
	"Which command shows all current sync sources as well as their stratum?": "chronyc sources",
	"What file should be modified to have a variable set for every new shell?": "/etc/bashrc",
	"What command would you use to read info stored as a techinfo file?": "pinfo",
	"If rm is aliased to rm -i and you don't want to answer yes for every file what command would you use?": "\rm",
	"How would you copy all files that have a name starting with d e or f from /etc to your home directory?": "cp /etc/[def]* ~",
	"How would you create an archive of /home and write to homebak.tgz?": "tar zcvf /home homebak.tgz",
	"How would you read line 8 from longfile?": "sed -n 8p longfile",
	"How would you replace the word 'me' with the word 'you' in samplefile?": "sed -i 's/me/you/g' samplefile",
	"What key combination takes you to the GUI?": "Ctrl-Alt-F2",
	"What is the device name of the first SSH session?": "/dev/pts/0",
	"How would you initiate an SSH session with support for graphical applications?": "ssh -X",
	"Where are group accounts stored?": "/etc/group",
	"Which command would you use to grant access to the group operations to all existing files?": "setfacl -m goperationsr *",
	"What command grants access to the group sales to /sales and all its subdirectories?": "setfacl -R -m gsalesrwx /salesdir",
	"How would you show link status only?": "ip link show",
	"What command should be issued after changing the contents of /etc/sysconfig/ifcfg files?": "nmcli con up",
	"How would you show the current routing configuration?": "ip route show",
	"What command checks if Network Manager is operational?": "systemctl status NetworkManager",
	"You have a directory containing RPM packages how would you make it a repo?": "createrepo",
	"How would you verify a repo is available?": "yum repolist",
	"Which command shows the contents of the yum group containing Security Tools?": "yum group info Security Tools",
	"Which command enables you to search for the image 'img' on a remote registry?": "podman search img",
	"How would you retrieve a container image called registry.fedoraproject.org/f29/httpd?": "podman pull registry.fedoraproject.org/f29/httpd",
	"How would you inspect the latest container?": "podman inspect -l",
	"How would you run the following httpd container registry.fedoraproject.org/f29/httpd on port 8080?": "podman run -dt -p 80808080/tcp registry.fedoraproject.org/f29/httpd",
	"How would you list created and running containers?": "podman ps",
	"How would you list all containers?": "podman ps -a",
	"How would you stop a container?": "podman stop -l",
	"How would you remove a container?": "podman rm -l",
	"Which filesystem would you use to mount a DVD?": "iso9660",
	"In which file would you set minimum password length?": "/etc/login.defs",
	"Which command would add user thomas to the sysadmins group?": "usermod -aG sysadmins thomas",
	"What command would make user jesse the owner of the /linux folder?": "chown jesse /linux",
	"What command would rename /dev/myvol/lvol0 to myfiles?": "lvrename /dev/myvol/lvol0 myfiles",
	"How would you point chronyc to time.example.com?": "chronyc -h time.example.com",
	"How would you create a compressed archive of /var and write it to var.tgz?": "tar zcvf var.tgz /var",
	"How would you copy /etc/resolv.conf to server.example.com as root?": "scp /etc/resolv.conf root@server.example.com/etc/resolv.conf",
	"Where is sudo defined?": "/etc/sudoers",
	"What tool is used to create GUID partitions?": "gdisk",
	"What tool is used to create MBR partitions?": "fdisk",
	"How would you log a message alert from the command line to the user facility as notice priority?": "logger -p user.notice alert",
	"How would you follow new journal messages in real time?": "journalctl -f",
	"How would you show journald messages since the last reboot?": "journalctl -b",
	"Which mount option specifies a filesystem that should not be automatically mounted?": "noauto",
	"How would you format a partition of type 82?": "mkswap",
	"What command would you run to test whether auto mounting of the partitions during boot is going to work?": "mount -a",
	"How would you format an ext4 partition?": "mkfs.ext4",
	"You need a UUID for a disk - how would you get it?": "blkid",
	"How would you create a volume group called vgroup that contains /dev/sdb3 with an extent size of 4 MiB?": "vgcreate vggroup -s 4 MiB /dev/sdb3",
	"How would you get the volume groups your physical volumes belong to?": "pvs",
	"What command shows which kernel module params are supported?": "modinfo",
	"Where do you specify kernel module parameters that should be used persistently?": "/etc/modprobe.d",
	"A ___ is a thing that is started by systemd.": "unit",
	"To ensure a target is no longer eligible for auto start on system boot use ____ _____.": "systemctl mask",
	"How would you load the SELinux policy?": "load_policy -i",
	"What command mounts sysroot for a password reset?": "mount -o remountrw /sysroot",
	"After mounting sysroot for a password reset what command would you enter?": "chroot /sysroot",
	"After recovering the root password what SELinux command would you use?": "touch /.autorelabel",
	"How would you point a repo to /repo?": "file///repo",
	"What command adds user tom with a non-interactive shell?": "useradd -s /sbin/nologin tom",
	"Which command adds user adam with uid 1234?": "useradd -u 1234 adam",
	"What file would you edit to set SELinux to enforcing?": "/etc/selinux/config",
	"How would you get the current default target?": "systemctl get-default",
	"How would you change the default target to graphical?": "systemctl set-default graphical.target",
	"What command adds a group called 'qa' with GID 30000?": "groupadd -g 30000 qa",
	"Which command creates a user 'jerry' with a secondary group of windows?": "useradd -G windows jerry",
	"How would you force user martin to change his password?": "chage -d 0 martin",
	"What command makes user steven's account expire on 2021-12-31?": "chage -E 2021-12-31 steven",
	"What command causes user chris' account to have to set a new password every 14 days?": "chage -M 14 chris",
	"How would you create a logical volume of 400M called storage in the volume group files?": "lvcreate -n storage -L 400M files",
	"What command creates an xfs filesystem for logical volume 'storage' in the volume group 'files'?": "mkfs -t xfs /dev/files/storage",
	"What is the name of the utility that generates the initramfs?": "dracut",
	"In the context of rsyslogd what is the source where log info comes from?": "facility",
	"How would you list all service units?": "systemctl list-unit-files -at service",
	"How would you check if atd was active?": "systemctl is-active atd",
	"How would you restrict the httpd service from running?": "systemctl mask httpd",
	"How would you get all timezones?": "timedatectl list-timezones",
	"How would you set timezone to Vancouver?": "timedatectl set-timezone America/Vancouver",
	"Where would user john's cron job be stored?": "/var/spool/cron/john",
	"Where would system-wide cron jobs be stored?": "/etc/cron.d",
	"Where would you put a script to run it weekly?": "/etc/cron.weekly",
	"What file would you create to prevent anyone from using cron?": "/etc/cron.deny",
	"What file would you create to prevent anyone from using at?": "/etc/at.deny",
	"What text would you add to GRUB to enter emergency mode?": "systemd.unit=emergency",
	"What tar switch preserves SELinux security contexts?": "--xattrs",
	"What switches would you use to create an uncompressed tar archive?": "-cvpf",
	"How would you show all man pages for crontab?": "man -f crontab",
	"How would you view all journal entries?": "journalctl",
	"How would you see the latest packages to be installed?": "rpm -qa --last",
	"What command shows all yum config files?": "rpm -qc yum",
	"Which command using dnf shows which packages provides vim?": "dnf provides vim",
	"How can you find packages that have been replaced by different packages?": "yum list obsoletes",
	"How would you inspect a repo with skopeo?": "skopeo inspect --config",
	"How would you copy a container image with skopeo?": "skopeo copy",
	"What would you insert in a Dockerfile to enable Apache?": "RUN systemctl enable httpd",
	"How would you enable containers to run with SELinux?": "setsebool -P container_manage_cgroup on",
	"After creating a unit file for a container how would you configure it to start at boot?": "systemctl enable",
	"How would you check that the container my_site is running? ": "podman ps | grep mysite",
	"Where are encrypted group passwords stored? ": "/etc/gshadow",
	"Where are PAM config files stored? ": "/etc/pam.d",
	"What file determines name resolution order? ": "/etc/nsswitch.conf",
	"Where are exported filesystems for NFS stored? ": "/etc/exports",
	"How would you show the ARP table? ": "arp",
	"How would you initiate DORA for enp0s1? ": "dhclient enp0s1",
	"How would you view the process hierarchy? ": "pstree",
	"How would you view processes with SELinux security context? ": "ps -efZ",
	"What command enables you to run a process that will persist after logout? ": "nohup",
	"How would you get the PID of httpd? ": "pidof httpd",
	"How would you show the status of all services? ": "systemctl list-units -t service --all",
	"How would you change to the basic target? ": "systemctl isolate basic.target",
	"How would you change to rescue mode? ": "systemctl rescue",
	"Which regex pattern matches hex digits? ": "[[:xdigit:]]",
	"How would you update httpd? ": "yum upgrade httpd",
	"How would you get the ACLs of bob_file.txt in tabular format? ": "getfacl --tabular bob_file.txt",
	"How would you revoke write access to all users and groups on file1.txt? ": "setfacl -m m::rx file",
	"How would you store an ACL tree of /home in a file tree.facl? ": "getfacl -R /home > tree.facl",
	"What command scans a file and notifies you of its type? ": "file",
	"Which key combination allows a user to clear from the cursor to the end of the line? ": "Ctrl-K",
	"Which key combination allows a user to search through history? ": "Ctrl-R",
	"How would you execute command number 43 in history? ": "!43",
	"Which Bash shortcut or command copies the last argument of previous commands? ": "Esc+",
	"What command would you use to manage a virsh guest domain? ": "virsh",
	"What command makes journald persistent? ": "mkdir -p /var/log/journal",
	"To preserve SELinux contexts in a tar archive use ____. ": "star",
	"In a shell script how would you ping google.com if scriptfile.txt exists and is a regular file? ": "if [-f scriptfile.txt ] then ping google.com fi",
	"How would you write the first line of a for loop in a bash script that iterates through the range 1-10? ": "for i in {1..10}",
	"The ______ command may be expressed as square brackets separated from all other characters with whitespace. ": "test",
	"How would you change to the graphical target? ": "systemctl isolate graphical.target",
	"How would you check the scheduling attributes of process 123? ": "chrt -p 123",
	"How would you get the recommended profile for your system? ": "tuned-adm recommend",
	"What command creates a physical volume on /dev/sdc1? ": "pvcreate /dev/sdc1",
	"What tool shows vdo statistics? ": "vdostats",
	"What command is used for layered volumes? ": "stratis",
	"Which switches would be used with lsblk to get the UUID? ": "-fp",
	"In which file would you change the SELinux mode? ": "/etc/selinux/config",
	"What package contains restorecon? ": "policycoreutils",
	"What is the preferred alternative to chcon? ": "semanage fcontext",
	"What tool works with MBR and GPT? ": "parted",
	"Which command activates a swap space? ": "swapon",
	"What is the mount point of a swap device? ": "swap",
	"What is the default priority of a swap space? ": "-2",
	"What switch to parted defines the GPT partitioning scheme? ": "mklabel gpt",
	"How would you enable and activate stratisd with one command? ": "systemctl enable --now stratisd",
	"How would you add port 8000 TCP to the firewall? ": "firewall-cmd --add-port= 8000/tcp",
	"How would you check for SELinux alerts? ": "sealert -a /var/log/audit/audit.log",
	"Which package contains podman and skopeo? ": "container-tools",
	"How would you change to the previous working directory? ": "cd -",
	"Which command reloads the config files for httpd? ": "systemctl reload httpd",
	"Which command takes an argument and constructs a command of it? ": "eval",
	"Where are non-syslog console messages related to system startup stored? ": "/var/log/boot.log",
	"Where does the mail server log messages? ": "/var/log/maillog",
	"The highest numerical syslog priority is _____. ": "0",
	"The lowest numerical syslog priority is ____. ": "7",
	"Where would you create a script to modify the umask? ": "/etc/profile.d/local-umask.sh",
	"Which character would you append a command with to run it in the background? ": "&",
	"What command lists all signals? ": "kill -l",
	"What is the tar switch to preserve permissions? ": "-p",
	"What is the tar switch for .xz compression? ": "-J",
	"Which tar switch includes SELinux context support? ": "--selinux",
	"What comes first when linking the target or link name? ": "target",
	"How would you view all targets? ": "systemctl list-units --type=target --all",
	"Which tar switch creates an archive? ": "-c",
	"Which tar switch lists the contents of an archive? ": "-t",
	"Which tar switch uses gzip compression? ": "-z",
	"Which tar switch uses bzip2 compression? ": "-j",
	"Which tar switch specifies the file name? ": "-f",
	"Hard links cannot link to a ____. ": "directory",
	"Hard links can link across 2 filesystems: T/F? ": "F",
	"____ represents a regular file in a long listing. ": "-",
	"In chmod what character represents all users? ": "a",
	"Using chmod with what switch will add execute permission only if the file is a directory or already has execute set for user group or other? ": "X",
	"How would you set the owner and group owner of /admin to sysadmin in one command? ": "chown sysadmin:sysadmin /admin",
	"Which man section is reserved for config files? ": "5",
	"How would you switch to the multi-user target? ": "systemctl isolate multi-user.target",
	"What would you append to GRUB to enter the rescue target? ": "systemd.unit=rescue.target",
	"What key combination gives a core dump of a process? ": "Ctrl+Backslash",
	"You should always create your custom crontab files under the ___ directory.": " / etc / cron.d ",
	"How would you reload the systemd manager config ? ": "systemctl daemon - reload ",
	"Where are timers stored ? ": " / usr / lib / systemd / system ",
	"The _____ parameter defines whether to store system journals in a volatile manner or persistently across reboot.": "Storage ",
	"Configure systemd journaling in the ____ file. ": " / etc / systemd / journald.conf ",
	" Set journaling to ____ to make it persist after a reboot. ": " persistent ",
	" Using nmcli  how would you get the status of network devices ? ": " nmcli con show ",
	" How would you write a GPT disk label to / dev / vdb ? ": " parted / dev / vdb mklabel gpt ",
	" How would you turn LVM on on / dev / vdb ? ": " parted - s / dev / vdb set 1 lvm on ",
	" What command removes a physical volume ? ": " pvremove ",
	" How would you create a volume group vg01 on / dev / vdb2 ? ": " vgcreate vg01 / dev / vdb2 ",
	" How would you delete a logical volume ? ": " lvremove ",
	" How would you mount the directory 'share' on serverb on mountpoint ? ": " sudo mount - t nfs - o rw sync serverb: /share mountpoint",
	"How would you unmask sshd? ": "systemctl unmask sshd.service",
	"How would you display all available modules? ": "yum module list",
	"What SELinux command would you run to have an httpd server in /web that would not survive a relabeling ? ": " chcon - t httpd_sys_content_t / web ",
	" How would you get all SELinux booleans ? ": " getsebool - a ",
	" How would you open a shell inside the container registry.access.redhat.com / ubi7 / ubi ? ": " podman run - it registry.access.redhat.com / ubi7 / ubi / bin / bash ",
	" Which command allows you to run a process inside a running container ? ": " podman exec ",
	" How would you log in using podman ? ": " podman login ",
	" Which switch sets an environment variable in podman ? ": " - e ",
	" How would you create a unit file for the web container ? ": " podman generate systemd--name web--files--new ",
	" How would you start a container using systemd ? ": " systemctl--user start container - web ",
	" How would you enable a container web to start on boot ? ": " systemctl--user enable container - web ",
	" How would you enable user processes to start on boot ? ": " loginctl enable - linger ",
	" What command allows Apache to run a Document Root in /custom? ": "semanage fcontext -a -t httpd_sys_content_t '/custom / (.*) ? '",
	"Which SELinux command provides information on a1-b2-c3? ": "sealert -l a1-b2-c3",
	"What command verifies fstab? ": "findmnt --verify",
	"What command waits for the system to register the new partition and returns when it' s done ? ": " udevadm settle ",
	" How would you show enabled swap spaces ? ": " swapon--show ",
	" What command lists SELinux booleans their default value current value and what they do ?": " semanage boolean - l ",
	" What would you set as a GRUB option to set SELinux to permissive ? ": " enforcing = 0 ",
	" How would you get all SELinux file contexts ? ": " semanage fcontext - l ",
	" If you do not include the _______ mount option in /etc/fstab for each Stratis file system the machine will fail to start properly and will abort to emergency.target the next time it is rebooted. ": " x - systemd.requires = stratisd.service ",
	" What command should you enter for Apache to serve content from / lab - content by changing the file context ? ": " semanage fcontext - a - t httpd_sys_content_t '/lab-content(/.*)?' ",
	" What command should you enter after changing the file context of the DocumentRoot / lab - content ? ": " restorecon - R / lab - content / ",
	" What filesystem type is used by parted for swap devices ? ": " linux - swap ",
	" What command forces systemd to read / etc / fstab ? ": " systemctl daemon - reload "
}
